; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v2 ?v12)
             (pred_10 ?v5 ?v13)
             (pred_12 ?v2 ?v13)
             (pred_11 ?v1 ?v2 )
	     (pred_2 ?v2)
             (pred_5 ?v6)
             (pred_8 ?v5)
             (pred_3 ?v13)
             (pred_6 ?v2)
             (pred_9 ?v5)
             (pred_1 ?v2)
             (pred_7 ))



(:action op_1
:parameters (?v8 ?v9 ?v10 ?v3)
:precondition (and (pred_5 ?v8) (pred_5 ?v9) (pred_8 ?v10) (pred_3 ?v3)
          (pred_4 ?v8 ?v9) (pred_10 ?v10 ?v3)
                   (pred_12 ?v9 ?v3) (pred_2 ?v8) 
                   (pred_6 ?v9) (pred_9 ?v10))
:effect (and  (pred_1 ?v9) (not (pred_6 ?v9))))


(:action op_5
:parameters (?v8 ?v11)
:precondition (and (pred_5 ?v8) (pred_5 ?v11)
               (pred_2 ?v8) (pred_4 ?v8 ?v11) (pred_1 ?v11))
:effect (and (pred_2 ?v11) (not (pred_2 ?v8))))

(:action op_4
:parameters (?v8 ?v10)
:precondition (and (pred_5 ?v8) (pred_8 ?v10) 
                  (pred_2 ?v8) (pred_11 ?v10 ?v8) (pred_7 ))
:effect (and (pred_9 ?v10)
   (not (pred_11 ?v10 ?v8)) (not (pred_7 ))))


(:action op_3
:parameters (?v8 ?v4 ?v7)
:precondition (and (pred_5 ?v8) (pred_8 ?v4) (pred_8 ?v7)
                  (pred_2 ?v8) (pred_9 ?v7) (pred_11 ?v4 ?v8))
:effect (and (pred_9 ?v4) (pred_11 ?v7 ?v8)
        (not (pred_9 ?v7)) (not (pred_11 ?v4 ?v8))))

(:action op_2
:parameters (?v8 ?v10)
:precondition (and (pred_5 ?v8) (pred_8 ?v10) 
                  (pred_2 ?v8) (pred_9 ?v10))
:effect (and (pred_7 ) (pred_11 ?v10 ?v8) (not (pred_9 ?v10)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_13 obj_18 obj_11 obj_17 obj_09 obj_12 obj_04 obj_15 obj_08 obj_05 obj_06 obj_20 obj_10 obj_19 obj_07
    obj_16 obj_14
    obj_01 obj_02
    )

    (:init
       (pred_7)

       (pred_5 obj_03)
       (pred_5 obj_13)
       (pred_5 obj_18)
       (pred_5 obj_11)
       (pred_5 obj_17)
       (pred_5 obj_09)
       (pred_5 obj_12)
       (pred_5 obj_04)
       (pred_5 obj_15)
       (pred_5 obj_08)
       (pred_5 obj_05)
       (pred_5 obj_06)
       (pred_5 obj_20)
       (pred_5 obj_10)
       (pred_5 obj_19)
       (pred_5 obj_07)
       (pred_3 obj_16)
       (pred_3 obj_14)
       (pred_8 obj_01)
       (pred_8 obj_02)

       (pred_4 obj_03 obj_17)
       (pred_4 obj_03 obj_13)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_13 obj_18)
       (pred_4 obj_13 obj_03)
       (pred_4 obj_18 obj_12)
       (pred_4 obj_18 obj_11)
       (pred_4 obj_18 obj_13)
       (pred_4 obj_11 obj_04)
       (pred_4 obj_11 obj_18)
       (pred_4 obj_17 obj_15)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_17 obj_03)
       (pred_4 obj_09 obj_08)
       (pred_4 obj_09 obj_12)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_12 obj_05)
       (pred_4 obj_12 obj_04)
       (pred_4 obj_12 obj_18)
       (pred_4 obj_12 obj_09)
       (pred_4 obj_04 obj_06)
       (pred_4 obj_04 obj_11)
       (pred_4 obj_04 obj_12)
       (pred_4 obj_15 obj_20)
       (pred_4 obj_15 obj_08)
       (pred_4 obj_15 obj_17)
       (pred_4 obj_08 obj_10)
       (pred_4 obj_08 obj_05)
       (pred_4 obj_08 obj_09)
       (pred_4 obj_08 obj_15)
       (pred_4 obj_05 obj_19)
       (pred_4 obj_05 obj_06)
       (pred_4 obj_05 obj_12)
       (pred_4 obj_05 obj_08)
       (pred_4 obj_06 obj_07)
       (pred_4 obj_06 obj_04)
       (pred_4 obj_06 obj_05)
       (pred_4 obj_20 obj_10)
       (pred_4 obj_20 obj_15)
       (pred_4 obj_10 obj_19)
       (pred_4 obj_10 obj_08)
       (pred_4 obj_10 obj_20)
       (pred_4 obj_19 obj_07)
       (pred_4 obj_19 obj_05)
       (pred_4 obj_19 obj_10)
       (pred_4 obj_07 obj_06)
       (pred_4 obj_07 obj_19)
       (pred_6 obj_18)
       (pred_6 obj_10)
       (pred_12  obj_18 obj_16)
       (pred_12  obj_10 obj_14)
       (pred_1 obj_03)
       (pred_1 obj_13)
       (pred_1 obj_11)
       (pred_1 obj_17)
       (pred_1 obj_09)
       (pred_1 obj_12)
       (pred_1 obj_04)
       (pred_1 obj_15)
       (pred_1 obj_08)
       (pred_1 obj_05)
       (pred_1 obj_06)
       (pred_1 obj_20)
       (pred_1 obj_19)
       (pred_1 obj_07)

       (pred_10  obj_01 obj_16)
       (pred_10  obj_02 obj_14)
       (pred_11 obj_01 obj_20)
       (pred_11 obj_02 obj_05)
       (pred_2 obj_17)
    )

    (:goal (and
       (pred_11 obj_01 obj_18)
    ))
(:constraints
  (always (not (pred_2 obj_13)))
)
)

; plan
1. (op_5 obj_17 obj_15)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_15)
   goals met: 0 of 1
2. (op_5 obj_15 obj_20)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_20)
   goals met: 0 of 1
3. (op_4 obj_20 obj_01)
   deleted: (pred_11 obj_01 obj_20) (pred_7)
   added: (pred_9 obj_01)
   goals met: 0 of 1
4. (op_5 obj_20 obj_15)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_15)
   goals met: 0 of 1
5. (op_5 obj_15 obj_17)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_17)
   goals met: 0 of 1
6. (op_5 obj_17 obj_09)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_09)
   goals met: 0 of 1
7. (op_5 obj_09 obj_12)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_12)
   goals met: 0 of 1
8. (op_1 obj_12 obj_18 obj_01 obj_16)
   deleted: (pred_6 obj_18)
   added: (pred_1 obj_18)
   goals met: 0 of 1
9. (op_5 obj_12 obj_18)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_18)
   goals met: 0 of 1
10. (op_2 obj_18 obj_01)
   deleted: (pred_9 obj_01)
   added: (pred_7) (pred_11 obj_01 obj_18)
   goals met: 1 of 1
